#include<stdio.h>
int main()
{
    //思考1：数学计算中，判断一个数是否为偶数，使用哪个关系运算符呢？
    int a = 11;
    printf("%d\n",a % 2 == 0);//1 偶数   0 奇数
    
    //思考2：数学计算中，判断一个数字是否不超过100，使用哪个关系运算符呢？
    // <=
    int number = 100;
    printf("%d\n",number <= 100);

    //思考3：电商项目的支付功能业务，需要判断银行卡余额是否足够，使用哪个关系运算符呢？
    //需要支付的钱<=银行卡的余额
    //银行卡的余额>=需要支付的钱
    int pay = 100;//需要支付的钱
    int money = 200;//余额
    printf("%d\n",pay <= money);

    //思考4：电商项目的购买商品业务，需要判断货物的库存是否足够，使用哪个关系运算符呢？
    //购买商品的数量
    //库存
    int buy = 10;
    int ware = 100;
    printf("%d\n",ware >= buy);

    //思考5：点餐项目的筛选商品业务，需要点不低于100元的，使用哪个运算符呢？
    int goods = 500;//商品的价格
    printf("%d\n",goods >= 100);

}