#include<stdio.h>
int main()
{
    /*
     给你一个整数n，请你判断该整数是否为2的幂次方
     举例：
            n = 1  输出：yes  2的0次方
            n = 2  输出：yes  2的1次方
            n = 3
            n = 4  输出：yes  2的2次方  
            n = 5  输出：no

     0      1
     1      2
     2      4
     3      8
     4      16
     5      32
     6      64
     7      128
     8      256
     9      512
     10     1024
     
     规则：任意的一个数字，不断的除以2，最终都会得到数字1

     循环的结束条件是什么？
     1.结果是1的时候，就可以结束了，yes
     2.结果无法被2再次整除了，也可以结束了，no
     
     */

     //1.定义一个变量记录的数字
     int n = 1024;

     //2.利用循环不断地除以2
     //小括号里面写的是什么：什么情况下，循环可以继续执行，跟上面的推断是反过来的
     while(n > 1 && n % 2 == 0)
     {
       n = n/2;
     }

     //3.判断
     if(n == 1)
     {
       printf("yes\n");
     }
     else
     {
       printf("no\n");
     }
     return 0;
} 