#include<stdio.h>
int main()
{
    /*
      需求：
          将一个整数x,进行反转
      举例：
          123 ---> 321 
      
      思路：
          原先的数字：123
          反转之后的数字：321
          
      从右边开始，依次获取每次一位数字，再次拼接起来    
    */

    //1.定义两个变量
    int number = 123;
    int rev = 0;

    //2.从右边开始，依次获取number每一位数字，再次拼到rev当中
    //第一次获取：123 % 3 = 3；
    //0 * 10 + 3 = 3

    //第二次获取：12 % 10 = 2
    //3 * 10 + 2 = 32

    //第三次获取：1 % 10 = 1
    
    //循环的结束条件：number == 0
    //小括号当中书写的是：什么情况下，循环要继续执行 

    while(number != 0)
    {
      //获取number右边的第一位数字
      int temp = number % 10;
      //去掉刚刚获取的数字
      number = number / 10;
      //把刚刚获取的数字拼接到REV变量当中
      rev = rev * 10 + temp;
    }

    //3.打印
    printf("%d\n",rev);
    return 0;
}    