#include<stdio.h>
int main()
{ 
    /*
      需求：
          给你一个非负整数x,计算并返回x的算术平方根
          结果只保留整数部分，小数部分被舍去
          举例：
              x = 4  结果：2
              x = 8  结果：2

      思路：
         17
            1 * 1 = 1 < 17
            2 * 2 = 4 < 17
            3 * 3 = 9 < 17
            4 * 4 = 16 < 17
            5 * 5 = 25 > 17
            17的平方根：保留整数4
        
        8
            1 * 1 = 1 < 8
            2 * 2 = 4 < 8
            3 * 3 = 9 > 8
            
        16
            1 * 1 = 1 < 16
            2 * 2 = 4 < 16
            3 * 3 = 9 < 16
            4 * 4 = 16 == 16
            5 * 5 = 25 > 16  
            
      规则：
            任意的数字而言，如何确定平方根的整数部分呢？
            从1开始一个一个的找’直到第一个相乘的结果大于原来的数字 
            那么前一个数字的整数部分就是他平方根的整数部分     
    */

    //1.定于一个变量
    int number = 17;

    //2.我要从1开始去找平方根的整数部分
    int i = 1;
    //3.利用循环去找平方根的整数部分
    while(i * i <= number)
    {
        i++;
    }

    //4.当循环结束之后，表示我已经找到了整数部分
    //i的前一个数字，-1即可
    printf("%d\n",i-1);
     
    return 0;
}    