#include<stdio.h>
int main()
{
    /*
       给定整数n，获取所有小于等于n的质数的数量
           示例：
                输入：n = 100
                输出：25
       质数：只能被1和本身整除的数字
       
       抽丝剥茧大法
       复杂的问题 --> 简单的问题

       1.判断一个整数是否是一个质数
       2.添加范围  1~100
       3.统计
    */

    //定义一个变量，用来统计2~100之间一共有多少个质数
    int countA = 0;

    for(int i = 2;i <= 100;i++)
    {
        //i:依次表示2~100之间

        //统计从2开始，到i-1，在这个范围之内，有多少个数字能被i整除
        int count = 0;
        for(int j = 2;j < i;j++)
         {
             if(i % j == 0)
             { 
                 //找到了一个数字能被i整除
                 count++;
                 //后面的其他数字就没有必要再次判断了
                 break;
             }  
         }

         //对count进行判断
         if(count == 0)
         {
           countA++;
         }
    }
    
    //打印countA
    printf("%d\n",countA);
    
    return 0;
}     