#include<stdio.h>
int main()
{
    /*
       1的1次方 + 2的2次方 + 3的3次方 + ... + 10的10次方，结果是多少？
       提示：结果过大用long long类型
       正确答案：10405071317
       
    */

    //定义一个变量，用于累加最终的结果
    long long res = 0;
    
    //外循环：依次表示  1——10
    for(int i = 1;i <= 10;i++)
    {
        //内循环：表示外循环的数字一共要乘几次
        //i = 1:乘1次
        //i = 2:乘2次
        //i = 3:乘3次

        //表示1的1次方 + 2的2次方 + 3的3次方 + ... + 10的10次方式子当中，每一个选项的单独结果
        long long pow = 1;
        for(int j = 1;j <= i;j++)
        {
           pow = pow* i;
        }
       //当内循环结束之后，就表示每一个单独的选项，已经有结果了
       //累加的目的：就是把每一个选项的单独结果相加
       res = res + pow; 
    }

    //打印
    printf("%lld\n",res);

    return 0;
}     