#include<stdio.h>
#include<stdlib.h>
#include<time.h>
int main()
{
    /*
       随机数的两个小弊端：
             1.种子不变，随机数结果是固定的
             2.随机数的范围
             默认范围：0~32767

             任意的范围之内获取一个随机数
             1 - 100
             7 - 23
             8 - 49

         绝招：用于生产任意范围之内的随机数
         1.把这个范围变成包头不包尾，包左不包右的 7 - 24
         2.拿着尾巴减开头   24 - 7 = 17
         3.修改代码 

        1.设置种子 
        srand(time(NULL));
        2.获取随机数
        int num = rand() % 17 + 7;//0 —— 16 + 7   7 —— 23
        3.输出打印
        printf("%d\n",num); 
    */

    //1.设置种子
    //种子：不能固定不变，结果就不变
    //用一个变化的数据去充当种子
    srand(time(NULL));

    
    for(int i = 1;i <= 10;i++)
    {
          //2.获取随机数
        int num = rand();
         //3.输出打印
        printf("%d\n", num);
    }
    return 0;
}        